artillery-data/basicGetTest.yml
config:
  target: "http://localhost:3003"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "warming up"
    - duration: 60
      arrivalRate: 10
      rampTo: 35
      name: "ramping to 20 instances/second"
    - duration: 120
      arrivalRate: 35
      name: "stress test for a minute"
  payload:
    path: "listingIdsData.csv"
    fields:
      - "listingIds"
      - "targetDate"
      - "targetMonth"
      - "reservationId"
      - "newCharge"
      - "deleteReservation"
      - "listingIds"
      - "checkIn"
      - "checkOut"
      - "guestId"
      - "adults"
      - "pups"
      - "charge"
scenarios:
  - name: "Get listings by id"
    weight: 30
    flow:
      - loop:
        - get:
            url: "/api/listings/{{ listingIds }}"
        count: 50
  - name: "Get dates by target date"
    weight: 15
    flow:
      - loop:
        - get:
            url: "/api/dates/{{ listingIds }}?targetDate={{ targetDate }}"
        count: 50
  - name: "Get dates for current month"
    weight: 15
    flow:
      - loop:
        - get:
            url: "/api/dates/{{ listingIds }}?month={{ targetMonth }}"
        count: 50
  - name: "Put new charge to reservation"
    weight: 2
    flow:
      - loop:
        - put:
            url: "/api/reservations/{{ reservationId }}/change_total_charge/{{ newCharge }}"
        count: 50
  - name: "Delete a reservation"
    weight: 1
    flow:
      - loop:
        - delete:
            url: "/api/reservation/{{ deleteReservation }}/remove"
        count: 50
  - name: "Post new reservation"
    weight: 5
    flow:
      - loop:
        - post:
            url: "/api/reservations/new"
            json:
              listingId: {{ listingIds  }}
              checkIn: {{ checkIn }}
              checkOut: {{ checkOut }}
              guestId: {{ guestId }}
              adults: {{ adults }}
              pups: {{ pups }}
              charge: {{ charge }}
        count: 5